{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "Performed in a rep-drop format: 12-10-8-6-4

Bicep Curls
Arnold Press
Lying Skull Crushers
Push Ups 
Reverse Grip Bent Over Rows
See the workout video above for a demonstration of each upper body exercise.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FWarmUp%2F10%20Best%20Mobility%20Flexibility%20Drills%20(PRE-WORKOUT).mp4?alt=media&token=633e0f69-1cae-4d7a-82f4-eb4408e81165" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale11.jpg?alt=media&token=5bbc3161-4788-4181-88e0-b40e2cc3a7cc",
      "title" : "25 MINUTE UPPER BODY AND CORE WORKOUT"
    }, {
      "description" : "
Now that you understand the importance of training your upper body, let's get started! Instead of giving you a full upper body workout that you need to follow, we'll give you the 10 best upper body exercises that will target these muscle groups:

Push exercises -  Targets pectoral (chest) muscles, lats, triceps, shoulders, and trapezius muscles (shoulders and upper back). 
Pull exercises - Targets upper back, center of the back, rhomboids (the top of the back), and bottom of the back.
Flexion/Extension exercises - Targets biceps, triceps, wrist flexors and extensors, shoulder muscles, upper abs, chest, and back muscles.
From these, you can create your own home or gym upper body workouts! You can create full upper body workouts, or implement a proper training split to ensure you don't overuse any specific muscle by splitting it up into push and pull workouts. 

We wanted to make these exercises adjustable for home and gym workouts, so you won't be needing any fancy or heavy equipment, but you will need these...

Dumbbells (5-15lbs) - just pick a weight that you're comfortable with, and one that challenges you
A mat - Not really needed, but good to have if you don't want to sit on the floor
Bench (gym) or table (home)
Oh, and don't forget to warm-up! Before starting any workout, warm-up properly. Pick a few exercises that will stretch and loosen up the muscles you'll be working. We recommend the following arm stretches: arm circles, lat stretch, cat and camel, triceps stretch, spinal rotations, and banded pull-aparts. To take your warm-up even further, use a long resistance band to mimic movements you'll be doing to activate the muscles before adding a heavier weight. Like doing banded bicep curls, rows, shoulder press, etc. Taking the time to warm-up properly will ensure your muscles are activated and ready for the heavy weight they're about to lift!",
      "sources" : [ "http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/WhatCarCanYouGetForAGrand.mp4" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale22.jpg?alt=media&token=a9ab75ce-135d-42f4-b52c-da967ec40b8a",
      "title" : "UPPER BODY AT HOME OR GYM 30 MINUTE PARTNER WORKOUT"
    } ]
  } ]
}
