{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "The perfect leg workout must consist of compound exercises for the quads, glutes and hamstrings while not overlooking the smaller muscles of the hips and our ability to train in all three planes.  In this leg workout, you will find that we overlook no component of upper leg training and get you training like an athlete in the process.
As with all videos in this perfect workout series, the goal here is to make sure you will build not only size by following these leg exercises but strength and explosiveness as well.  This starts as always with a compound movement for the legs, and there is none better than the squat.  While warming up to perform the squat the key is not to exhaust yourself more than necessary.  Too many times, people perform too many warmups, cutting into energy reserves for their working sets.
What you should do instead, is do a few reps with your sub-working weight to loosen up your joints. Just before starting your first work set, perform one touch-up set with about 10 percent more than what you will be using for your workout.  Perform just 1 to 2 reps here to prepare the nervous system and neurologically “lighten” the load that is to come.
Work your way from sets of 5 to a set of 25 grueling reps on the squats before moving onto the next component of this leg workout; the posterior chain compound exercise.
Here you have two choices.  You can either do the barbell hip thrust or the glute ham raise.  Keep in mind, because you will be able to significantly load the barbell hip thrust more than you will the glute ham raise, you will want to opt for this exercise if your main goal is training for strength.  That said, if you are looking to get more active engagement of the hamstrings through their concentric range of motion, then you will want to do the GHR since it contributes in areas that the hip thrust only isometrically challenges.
The next exercise is the hi/low dumbbell bulgarian split squat.  This is a necessary component of any athletic lower body training approach because it is a unilateral exercise.  Not only do the dynamic stability benefits shine through here but it challenges the body in the frontal plane in ways that traditional bilateral training via squats cannot do.  Alternate the position of your torso on each rep to ensure you hit both the quads and the glutes more effectively on each rep.
The TKE Drop Lunge is a great way to ensure resistance through terminal knee extension.  Now, it is important that you understand that there is no way to isolate the medial or inner portion of the quads during an exercise.  What you can do however is ensure that this separately innervated head of the quads gets full stimulation by going to a full lockout position of extension on every rep.  We can overload that with the addition of the band as well.
Next, no perfect leg workout would be complete without the additional focus on the inside and outside of our legs.  The adductors are hit tremendously well with the Goblet Adductor Lunge shown in this video.  Don’t just step back up to the top, but slide or squeeze your legs together to get yourself back to a standing position.  This will light up the all important adductor muscles on the inside of your thighs and help you to build the strength needed.
Finally, you have to hit the outside abductors of your legs as well.  This can be accomplished with the finisher shown.  The hip band ladder requires that you work your way up to 10 reps in each direction of a side step while making sure to keep your toes pointed straight ahead at all times.  This will strengthen the outside of your legs, which is an area that tends to be very weak.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FLowerBody%2FThe%20PERFECT%20Leg%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=4d1371b6-dd30-4f2f-9f40-57efa48b3a47" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnaillower.jpg?alt=media&token=99486517-a3a4-4dfa-b67d-2657afcebd04",
      "title" : "The PERFECT Leg Workout "
    }, {
      "description" : "WORKOUT DIRECTIONS
Do each move below for your selected interval of work and rest. At the end of all the moves, rest for 60 seconds. That's 1 circuit. Do the circuit 3–5 times. Then try the EMOM finisher.
Option 1: 30 seconds of work, 30 seconds of rest
Option 2: 40 seconds of work, 20 seconds of rest
Option 3: 50 seconds of work, 10 seconds of rest
EXERCISES
Superman With Arm Pulldown
Kneel-to-Stand Lunge (Alternating Sides)
Single-Leg Jackknife (Right Side)
Single-Leg Jackknife (Left Side)
Push-Up
10-10-10 EMOM FINISHER
Do each move below for 10 reps as fast as you can. If you finish in under 60 seconds, rest. At the start of the next minute, repeat the circuit again. Continue in this way for 4 minutes. Note: Each side equals 1 rep.
Rainbow Hop x 10 reps
Mountain Climber x 10 reps
Crab Toe Touch x 10 reps.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyFemale%2F25%20MINUTE%20UPPER%20BODY%20AND%20CORE%20WORKOUT%20%5B%20TONE%2C%20SCULPT%2C%20TIGHTEN%20CORE%5D%20FOR%20ALL%20FITNESS%20LEVELS.mp4?alt=media&token=887f1559-871e-4c29-b5fc-4ef59068021f" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale11.jpg?alt=media&token=5bbc3161-4788-4181-88e0-b40e2cc3a7cc",
      "title" : "25 MINUTE UPPER BODY AND CORE WORKOUT"
    }, {
      "description" : "Now that you understand the importance of training your upper body, let's get started! Instead of giving you a full upper body workout that you need to follow to the "T", we'll give you the 10 best upper body exercises that will target these muscle groups:
Push exercises -  Targets pectoral (chest) muscles, lats, triceps, shoulders, and trapezius muscles (shoulders and upper back). 
Pull exercises - Targets upper back, center of the back, rhomboids (the top of the back), and bottom of the back.
Flexion/Extension exercises - Targets biceps, triceps, wrist flexors and extensors, shoulder muscles, upper abs, chest, and back muscles.
From these, you can create your own home or gym upper body workouts! You can create full upper body workouts, or implement a proper training split to ensure you don't overuse any specific muscle by splitting it up into push and pull workouts. 
We wanted to make these exercises adjustable for home and gym workouts, so you won't be needing any fancy or heavy equipment, but you will need these...
Dumbbells (5-15lbs) - just pick a weight that you're comfortable with, and one that challenges you
A mat - Not really needed, but good to have if you don't want to sit on the floor
Bench (gym) or table (home)
Oh, and don't forget to warm-up! Before starting any workout, warm-up properly. Pick a few exercises that will stretch and loosen up the muscles you'll be working. We recommend the following arm stretches: arm circles, lat stretch, cat and camel, triceps stretch, spinal rotations, and banded pull-aparts. To take your warm-up even further, use a long resistance band to mimic movements you'll be doing to activate the muscles before adding a heavier weight. Like doing banded bicep curls, rows, shoulder press, etc. Taking the time to warm-up properly will ensure your muscles are activated and ready for the heavy weight they're about to lift!.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyFemale%2FUPPER%20BODY%20AT%20HOME%20OR%20GYM%2030%20MINUTE%20PARTNER%20WORKOUT.mp4?alt=media&token=638998d4-8fed-45d7-8cec-6c8df31971a5" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale22.jpg?alt=media&token=a9ab75ce-135d-42f4-b52c-da967ec40b8a",
      "title" : "UPPER BODY AT HOME OR GYM 30 MINUTE PARTNER WORKOUT"
    } ]
  } ]
}
